"use client";

export default function PrintForm() {
    return (
        <div className="text-gray-800" style={{ paddingTop: 5, width: "800px", margin: "0 auto", fontFamily: "sans-serif", }}>
            <h1 className="text-md font-bold ">แบบฟอร์มเรียกร้องค่าสินไหมกรณีผู้ป่วยนอก Outpatient (OPD) and Accident Claim Form</h1>
            <div className="pl-6 ">
                <div className="flex gap-[100px]">
                    <p>Hospital Name พระปกเกล้า จันทบุรี</p>
                    <p>Company Name.................................................</p>
                </div>
                <div className="flex gap-[176px] ">
                    <p>☐ Individual Insurance</p>
                    <p>☐ Group Insurance</p>
                </div>
            </div>
            <strong>Part A</strong>
            <div className="border px-2 pb-3">
                <h1 className="text-center text-sm font-bold">สำหรับผู้เอาประกันภัย</h1>
                <div className="mt-2">
                    <div className="flex gap-1 text-xs">
                        <p>1. ชื่อ-นามสกุล ผู้เอาประกันภัย : ................................................................</p>
                        <p>เพศ : ................</p>
                        <p>เลขประจำตัวประชาชน : ...........................................................</p>
                    </div>
                    <div className="flex gap-1 text-xs pl-3.5">
                        <p>วันเดือนปี เกิด : ................................................................</p>
                        <p>อายุ : ................ ปี</p>
                        <p>เดือน : ...............</p>
                        <p>อาชีพ : .........................................................................</p>
                    </div>
                    <div className="flex gap-1 text-xs pl-3.5">
                        <p>โทรศัพท์มือถือ : ................................................................</p>
                        <p>โทรศัพท์บ้าน : ...............................................</p>
                        <p>อีเมล : ..........................................................</p>
                    </div>
                    <div className="flex gap-1 text-xs pl-3.5">
                        <p>ที่อยู่ปัจจุบัน : .................................................................................................................................................................................................................</p>
                    </div>
                    <div className="flex gap-1 text-xs">
                        <p>2. กรมธรรม์เลขที่ : ..............................................................................................................................................................................................................</p>
                    </div>
                    <div className="flex gap-1 text-xs pl-3.5">
                        <p>มีกรมธรรม์บริษัทประกันอื่น ๆ หรือไม่ ☐ ไม่มี ☐ มี</p>
                        <p>1.บริษัท : ....................................................................</p>
                        <p>กรมธรรม์เลขที่ : .................................................</p>
                    </div>
                    <div className="flex gap-1 text-xs pl-63.5">
                        <p>2.บริษัท : ....................................................................</p>
                        <p>กรมธรรม์เลขที่ : .................................................</p>
                    </div>
                </div>
            </div>
            <div className="border-l border-r border-b px-2">
                <h1 className="text-center text-sm font-bold">หนังสือให้ความยินยอม</h1>
                <div className="mt-2">
                    <div className="flex gap-1 text-xs">
                        <p>1. ชื่อ-นามสกุล ผู้เอาประกันภัย : ................................................................</p>
                       
                    </div>
                    <div className="flex gap-1 text-xs pl-3.5">
                        <p>วันเดือนปี เกิด : ................................................................</p>
                        <p>อายุ : ................ ปี</p>
                        <p>เดือน : ...............</p>
                        <p>อาชีพ : .........................................................................</p>
                    </div>
                    <div className="flex gap-1 text-xs pl-3.5">
                        <p>โทรศัพท์มือถือ : ................................................................</p>
                        <p>โทรศัพท์บ้าน : ...............................................</p>
                        <p>อีเมล : ..........................................................</p>
                    </div>
                    <div className="flex gap-1 text-xs pl-3.5">
                        <p>ที่อยู่ปัจจุบัน : .................................................................................................................................................................................................................</p>
                    </div>
                    <div className="flex gap-1 text-xs">
                        <p>2. กรมธรรม์เลขที่ : ..............................................................................................................................................................................................................</p>
                    </div>
                    <div className="flex gap-1 text-xs pl-3.5">
                        <p>มีกรมธรรม์บริษัทประกันอื่น ๆ หรือไม่ ☐ ไม่มี ☐ มี</p>
                        <p>1.บริษัท : ....................................................................</p>
                        <p>กรมธรรม์เลขที่ : .................................................</p>
                    </div>
                    <div className="flex gap-1 text-xs pl-63.5">
                        <p>2.บริษัท : ....................................................................</p>
                        <p>กรมธรรม์เลขที่ : .................................................</p>
                    </div>
                </div>
            </div>
        </div>
    );
}