"use client";
import { Suspense } from "react";
export default function PrintForm() {
  return (
    <Suspense fallback={<div>Loading...</div>}>
      <style>
        {`
        @font-face {
        font-family: 'Sarabun';
        src: url('/fonts/THSarabun.ttf') format('truetype');
        }

        body {
          font-family: 'Sarabun', sans-serif;
        }
      `}
      </style>
      <div
        className="text-gray-800"
        style={{
          paddingTop: 5,
          width: "800px",
          margin: "0 auto",
          // fontFamily: "Sarabun",
        }}
      >
        <h1 className="text-center text-xl font-bold pl-0.5">
          แบบฟอร์มเรียกร้องค่าสินไหมกรณีผู้ป่วยนอก Outpatient (OPD) and Accident
          Claim Form
        </h1>
        <div className="w-[470px] mx-auto">
          <div className="flex gap-[100px] text-md">
            <p>
              Hospital Name <span>พระปกเกล้า จันทบุรี</span>
            </p>
            <p>Company Name.................................................</p>
          </div>
          <div className="flex gap-[150px] text-md">
            <p>☐ Individual Insurance</p>
            <p>☐ Group Insurance</p>
          </div>
        </div>
        <p className="text-sm pl-0.5">
          <strong>Part A</strong>
        </p>
        <div className="border px-2 pb-3">
          <h1 className="text-center text-sm font-bold">
            สำหรับผู้เอาประกันภัย
          </h1>
          <div className="mt-1">
            <div className="flex gap-1 text-xs">
              <p>
                1. ชื่อ-นามสกุล ผู้เอาประกันภัย :
                ...........................................................................................................................
              </p>
              <p>เพศ : ...................................</p>
              <p>
                เลขประจำตัวประชาชน :
                ........................................................................................................................
              </p>
            </div>
            <div className="flex gap-1 text-xs pl-3.5">
              <p>
                วันเดือนปี เกิด :
                ...................................................................................................
              </p>
              <p>อายุ : .................................... ปี</p>
              <p>เดือน : ...................................</p>
              <p>
                อาชีพ :
                ...........................................................................................................................................
              </p>
            </div>
            <div className="flex gap-1 text-xs pl-3.5">
              <p>
                โทรศัพท์มือถือ :
                .......................................................................
              </p>
              <p>
                โทรศัพท์บ้าน :
                .............................................................
              </p>
              <p>
                อีเมล :
                .......................................................................................................................................................................................
              </p>
            </div>
            <div className="flex gap-1 text-xs pl-3.5">
              <p>
                ที่อยู่ปัจจุบัน :
                .............................................................................................................................................................................................................................................................................................................................................................................
              </p>
            </div>
            <div className="flex gap-1 text-xs">
              <p>
                2. กรมธรรม์เลขที่ :
                .....................................................................................................................................................................................................................................................................................................................................................................
              </p>
            </div>
            <div className="flex gap-1 text-xs pl-3.5">
              <p>มีกรมธรรม์บริษัทประกันอื่น ๆ หรือไม่ ☐ ไม่มี ☐ มี</p>
              <p>
                1.บริษัท :
                ..................................................................................................................................................................................
              </p>
              <p>
                กรมธรรม์เลขที่ :
                ...........................................................................
              </p>
            </div>
            <div className="flex gap-1 text-xs pl-46.5">
              <p>
                2.บริษัท :
                ..................................................................................................................................................................................
              </p>
              <p>
                กรมธรรม์เลขที่ :
                ...........................................................................
              </p>
            </div>
          </div>
        </div>
        <div className="border-l border-r border-b px-8 pb-2">
          <h1 className="text-center text-sm font-bold">
            หนังสือให้ความยินยอม
          </h1>
          <div className="mt-1">
            <div className="text-xs text-justify">
              <p className="indent-8">
                ข้าพเจ้า ขอให้และยินยอมให้ แพทย์ สถานพยาบาล บริษัทประกันภัยอื่น
                หรือ บุคคลที่เกี่ยวข้อง ซึ่งมีข้อมูลส่วนบุคคล ข้อมูลสุขภาพ
                ความพิการ พฤติกรรมทางเพศ ข้อมูลชีวภาพ ข้อมูลพันธุกรรม เชื้อชาติ
                และประวัติการรักษาพยาบาลของข้าพเจ้าที่ผ่านมาหรือจะมีขึ้นในอนาคต
                สามารถเปิดเผยข้อมูลดังกล่าวให้แก่บริษัทตัวแทนประกันชีวิต
                ของบริษัท หรือผู้แทนของบริษัท หรือบริษัทนายหน้าประกันภัย
                หรือผู้ถือกรมธรรม์ เพื่อการขอเอาประกันภัย
                หรือการจ่ายเงินตามกรมธรรม์ประกันภัย หรือค่าเนินการใด ๆ
                ที่เกี่ยวข้องกับกรมธรรม์ประกันภัย
              </p>
              <p className="indent-8">
                ข้าพเจ้ายินยอมให้ บริษัท เก็บรวบรวม ใช่
                และเปิดเผยข้อมูลส่วนบุคคล ข้อมูลสุขภาพ ความพิการ พฤติกรรมทางเพศ
                ข้อมูลชีวภาพ ข้อมูลพันธุกรรม เชื้อชาติ และ
                ประวัติการรักษาพยาบาลของข้าพเจ้า ต่อหน่วยงานที่มีอ่านาจตามกฎหมาย
                หรือบริษัทนายหน้าประกันภัยต่อ หรือต่อบริษัทประกันภัยต่อ
                บุคคลที่เกี่ยวข้อง ตัวแทนประกันชีวิต ของบริษัท บุคคลากร
                หรือผู้แทนของบริษัท หรือผู้ถือกรมธรรม์
                และ/หรือบริษัทนายหน้าประกันภัย
                เพื่อการขอเอาประกันภัยหรือการจ่ายเงินตามกรมธรรม์ประกันภัย
                หรือใชประโยชน์ทางการแพทย์หรือเพื่อใช้ในการดาเนินการใด ๆ
                ที่เกี่ยวกับกรมธรรม์ประกันภัย
              </p>
              <p className="indent-8">
                กรณีที่เรียกร้องสินไหมผ่านโรงพยาบาล ข้าพเจ้ายินยอมและตกลงให้
                บริษัทจ่ายค่ารักษาพยาบาลให้แก่สถานพยาบาลที่ข้าพเจ้าได้เข้ารับการรักษานี้
                โดยถือเสมือน
                หนึ่งบริษัทได้จ่ายชดเชยค่ารักษาพยาบาลให้แก่ข้าพเจ้าโดยชอบแล้วตามข้อกําหนดและเงื่อนไขแห่งกรมธรรม์ประกันภัย
                ทั้งนี้ ค่ารักษาพยาบาลใด ๆ ที่อยู่นอกเหนือความ
                คุ้มครองของกรมธรรม์ประกันภัย
                ข้าพเจ้าจะเป็นผู้ชําระให้แก่สถานพยาบาลโดยตรงเอง และ
                ข้าพเจ้าเข้าใจเป็นอย่างดีว่า
                บริษัทจะขอสงวนสิทธิ์ตามข้อตกลงในโครงการชําระ
                ค่ารักษาพยาบาลผ่านโรงพยาบาล
                หากตรวจสอบพบว่าการเจ็บป่วยหรืออุบัติเหตุของข้าพเจ้าอยู่ภายใต้เงื่อนไขข้อยกเว้นของกรมธรรม์ประกันภัย
                แม้บริษัทจะได่ให้ความ
                เห็นชอบในการรับตัวไว้เป็นผู้ป่วยในเบื้องต้นแล้วก็ตาม ในกรณีนี้
                หากบริษัทได้สารองจ่ายค่ารักษา
                ให้แก่สถานพยาบาลแทนข้าพเจ้าไปแล้วข้าพเจ้ายินยอมที่จะชาระเงินทั้งสิ้น
                คืนแก่บริษัทภายใน 7 วันนับจากวันที่ได้รับค่าบอกกล่าวจากบริษัท
              </p>
              <p className="indent-8">
                อนึ่ง สาเนาใบหนังสื่อให้ความยินยอม
                ให้ถือว่ามีผลบังคับได้เช่นเดียวกับต้นฉบับ
              </p>
              <p className="indent-8">
                ข้าพเจ้าได้
                ทราบและเข้าใจข้อความตลอดจนเงื่อนไขและวิธีปฏิบัติของบริษัทตามเอกสารฉบับนี้
                เป็นอย่างดีโดยละเอียดครบถ้วนแล้ว เห็นว่าถูกต้องตามเจตนาของ
                ข้าพเจ้าจึงได้ตกลงยินยอมผูกพันปฏิบัติตามเงื่อนไข
                และวิธีปฏิบัติของบริษัท ทุกประการ
              </p>
              <p className="font-bold">หมายเหตุ :</p>
              <p className="pl-4">
                * กรณีผู้เอาประกันภัยเป็นผู้เยาว์
                ให้ผู้ปกครองลงนามแทนพร้อมระบุความสัมพันธ์
              </p>
              <p className="pl-4">
                ** กรณีลงนามโดยใชวิธีพิมพ์ลายนิ้วมือ ต้องมีพยานลงนามรับรอง 2
                ท่าน
              </p>
            </div>
            <div className=" text-sm pl-4.5 mt-4">
              <div className="flex items-center gap-1">
                <p>
                  ผู้เอาประกันภัย :
                  ................................................
                </p>
                <p>วันที่ : ...........................................</p>
                <p className="pl-4">
                  พยาน : ..........................................
                </p>
                <p className="pl-4">
                  พยาน : ..........................................
                </p>
              </div>
              <div className="pl-16 flex items-center gap-1">
                <p>(................................................)</p>
                <p>ความสัมพันธ์ : .............................</p>
                <p className="pl-10">
                  (..........................................)
                </p>
                <p className="pl-10">
                  (..........................................)
                </p>
              </div>
              <div className="flex items-center gap-1">
                <p>
                  ผู้ให้ความยินยอม :
                  .............................................
                </p>
                <p className="pl-2">ในฐานะ ☐ บิดา/มารดา</p>
              </div>
              <div className="flex items-center gap-1">
                <p className="pl-54.5">
                  ☐ ผู้เเทนโดยชอบธรรมของผู้เอาประกันภัย
                  (กรณีผู้เอาประกันภัยยังไม่บรรลุนิติภาวะ)
                </p>
              </div>
            </div>
          </div>
        </div>
        <div className="border-l border-r border-b px-2 pb-2">
          <h1 className="text-center text-sm font-bold">For Hospital</h1>
          <div className="mt-1 px-3">
            <div className="text-xs flex gap-2 ">
              <p>1.</p>
              <p className="pl-3">
                Visit date :
                ...........................................................
              </p>
              <p>
                Time : ........................................................
              </p>
              <p>
                Vital signs : T :
                ...................................................
              </p>
              <p>p : ...................................................</p>
              <p>
                BP : .........................................................
              </p>
            </div>
            <div className=" text-xs flex gap-2">
              <p>2.</p>
              <p className="pl-3">
                Chief complaint and duration :
                ...................................................................................................................................................................................................................................................................................................................
              </p>
            </div>
            <div className=" text-xs flex gap-2">
              <p>3.</p>
              <p className="pl-3">
                Present illness or cause of injury :
                ..............................................................................................................................................................................................................................................................................................................
              </p>
            </div>
            <div className="text-xs pl-7.5">
              <p>
                ............................................................................................................................................................................................................................................................................................................................................................................
              </p>
              <p>
                ............................................................................................................................................................................................................................................................................................................................................................................
              </p>
            </div>
            <div className=" text-xs flex gap-2">
              <p>4.</p>
              <p className="pl-3">
                An accident; Date of accident :
                ................................................
              </p>
              <p>
                Time :
                ..............................................................................................................................
              </p>
            </div>
            <div className="text-xs pl-7.5">
              <p>
                Place......................................................................................................................................................................................................................................
              </p>
            </div>
            <div className=" text-xs flex gap-2 pt-3">
              <p>5.</p>
              <p className="pl-3">
                Physical exam :
                ......................................................................................................................................................................................................................................................................................................................................................
              </p>
            </div>
            <div className="text-xs pl-7.5">
              <p>
                ................................................................................................................................................................................................................................................................................................................................................................................
              </p>
            </div>
            <div className=" text-xs flex gap-2">
              <p>6.</p>
              <p className="pl-3">
                Is the illness related to : (please tick ☑ if yes)
              </p>
            </div>
            <div className=" text-xs flex gap-2">
              <p className="pl-7.5">
                ☐ Pregnancy / Childbirth / Infertillty / Caesarean section /
                Miscarriage
              </p>
              <p className="pl-13.5">☐ Congenital / Hereditary disease </p>
            </div>
            <div className=" text-xs flex gap-2">
              <p className="pl-7.5">
                ☐ Nervous / Mental / Emotional / Sleeping disorder
              </p>
              <p className="pl-36">☐ Influence of Drugs / Alcohol</p>
            </div>
            <div className=" text-xs flex gap-2">
              <p className="pl-7.5">
                ☐ Cosmetic reason / Dental care / Refractive errors correction
              </p>
              <p className="pl-24">☐ AIDS</p>
            </div>
            <div className=" text-xs flex gap-2 pt-3">
              <p>7.</p>
              <p className="pl-3">
                Underlying condition :
                .......................................................................................................................................................................................................................................................................................................................................
              </p>
            </div>
            <div className=" text-xs flex gap-2">
              <p>8.</p>
              <p className="pl-3">
                Diagnosis :
                .........................................................................................................................................................................................................................................................................................................................................................
              </p>
            </div>
            <div className=" text-xs flex gap-2">
              <p>9.</p>
              <p className="pl-3">
                Inverstigation & Result (Lab, EKG, X - ray, etc) :
                ............................................................................................................................................................................................................................................................................................
              </p>
            </div>
            <div className=" text-xs flex gap-2">
              <p>10.</p>
              <p className="pl-1">Treatment</p>
            </div>
            <div className="text-xs pl-7.5">
              <p>
                ............................................................................................................................................................................................................................................................................................................................................................................
              </p>
              <p>
                ............................................................................................................................................................................................................................................................................................................................................................................
              </p>
            </div>
            <div className=" text-xs flex gap-2 pt-3">
              <p>
                Physician's name
                <span className="pl-6">
                  ........................................................................
                </span>
              </p>
              <p className="pl-6">
                Medical license No. ........................................
              </p>
              <p className="pl-3">
                Specialty.
                ......................................................................................
              </p>
            </div>
            <div className=" text-xs flex gap-2 pl-22">
              <p>
                (....................................................................)
              </p>
              <p className="pl-20">
                Date ........................................
              </p>
            </div>
          </div>
        </div>
        <h1 className=" text-xs pt-3">
          Remark: Doctor who issue this report must be a doctor who is licensed
          to practice medicine and correctly registered by the Thai Medical
          Council
        </h1>
      </div>
    </Suspense>
  );
}
