"use client";
import { Suspense } from "react";

export default function PrintForm() {
  return (
    <Suspense fallback={<div>Loading...</div>}>
      <div>
        {/* part A IPD */}
        <style>{`
        @font-face {
        font-family: 'Sarabun';
        src: url('/fonts/THSarabun.ttf') format('truetype');
        }

        body {
          font-family: 'Sarabun', sans-serif;
        }
        `}
        </style>
        <div
          className="text-gray-800"
          style={{
            paddingTop: 5,
            width: "800px",
            margin: "0 auto",
            // fontFamily: "Sarabun",
          }}
        >
          <h1 className="text-center text-xl font-bold pl-0.5">
            Admission Notification Form (all cases)
          </h1>
          <div className="w-[470px] mx-auto">
            <div className="flex gap-[100px] text-md">
              <p>
                Hospital Name <span>พระปกเกล้า จันทบุรี</span>
              </p>
              <p>
                Company Name.................................................
              </p>
            </div>
            <div className="flex gap-[150px] text-md">
              <p>☐ Individual Insurance</p>
              <p>☐ Group Insurance</p>
            </div>
          </div>
          <p className="text-lg pl-0.5">
            <strong>Part A</strong>
          </p>
          <div className="border px-2 pb-3">
            <h1 className="text-center text-lg font-bold">
              สำหรับผู้เอาประกันภัย
            </h1>
            <div className="mt-1">
              <div className="flex gap-1 text-xs">
                <p>
                  1. ชื่อ-นามสกุล ผู้เอาประกันภัย :
                  ........................................................................................................................................
                </p>
                <p>เพศ : ......................................</p>
                <p>
                  เลขประจำตัวประชาชน :
                  ....................................................................................................
                </p>
              </div>
              <div className="flex gap-1 text-xs pl-3.5">
                <p>
                  วันเดือนปี เกิด :
                  ....................................................................................
                </p>
                <p>อายุ : ................................... ปี</p>
                <p>เดือน : ..................................</p>
                <p>
                  อาชีพ :
                  ....................................................................................................................................................
                </p>
              </div>
              <div className="flex gap-1 text-xs pl-3.5">
                <p>
                  โทรศัพท์มือถือ :
                  ................................................................................................
                </p>
                <p>
                  โทรศัพท์บ้าน : ................................................................................
                </p>
                <p>
                  อีเมล :
                  .........................................................................................................................
                </p>
              </div>
              <div className="flex gap-1 text-xs pl-3.5">
                <p>
                  ที่อยู่ปัจจุบัน :
                  ................................................................................................................................................................................................................................................................................................................................................................
                </p>
              </div>
              <div className="flex gap-1 text-xs">
                <p>
                  2. กรมธรรม์เลขที่ :
                  ...........................................................................................................................................................................................
                </p>
                <p>
                  ใบรับรองเลขที่ (ถ้ามี) :
                  ........................................................................................................................
                </p>
              </div>
              <div className="flex gap-1 text-xs pl-3.5">
                <p>มีกรมธรรม์บริษัทประกันอื่น ๆ หรือไม่ ☐ ไม่มี ☐ มี</p>
                <p>
                  บริษัท :
                  ...........................................................................................................................................................................
                </p>
                <p>
                  กรมธรรม์เลขที่ :
                  ........................................................................
                </p>
              </div>
              <div className="flex gap-1 text-xs">
                <p>3. สาเหตุของการเรียกร้องครั้งนี้ :</p>
              </div>
              <div className="flex gap-1 text-xs pl-3.5">
                <p>
                  ☐ เจ็บป่วย อาการ :
                  .................................................................................................................................................
                </p>
                <p>
                  ระยะเวลาของอาการก่อนที่ จะเข้าการรักษาครั้้งนี้ :
                  ............................................................................................................
                </p>
              </div>
              <div className="flex gap-1 text-xs pl-3.5">
                <p>
                  สถานพยาบาลที่เคยรักษาก่อนที่จะเรข้ารับการรักษาครั้งนี้้ :
                  .........................................................................................................................................
                </p>
                <p>
                  วันที่เข้ารับการรักษา :
                  ......................................................................................................
                </p>
              </div>
              <div className="flex gap-1 text-xs pl-3.5">
                <p>
                  ☐ บาดเจ็บ วันที่ได้รับบาดเจ็บ :
                  ..................................................
                </p>
                <p>เวลา : ........................................</p>
                <p>
                  สถานที่เกิดเหตุ :
                  .........................................................................................................................................................................................
                </p>
              </div>
            </div>
          </div>
          <div className="border-l border-r border-b px-8 pb-2">
            <h1 className="text-center text-lg font-bold">
              หนังสือให้ความยินยอม
            </h1>
            <div className="mt-1">
              <div className="text-xs text-justify">
                <p className="indent-8">
                  ข้าพเจ้า ขอให้และยินยอมให้ แพทย์ สถานพยาบาล
                  บริษัทประกันภัยอื่น หรือ บุคคลที่เกี่ยวข้อง
                  ซึ่งมีข้อมูลส่วนบุคคล ข้อมูลสุขภาพ ความพิการ พฤติกรรมทางเพศ
                  ข้อมูลชีวภาพ ข้อมูลพันธุกรรม เชื้อชาติ
                  และประวัติการรักษาพยาบาลของข้าพเจ้าที่ผ่านมาหรือจะมีขึ้นในอนาคต
                  สามารถเปิดเผยข้อมูลดังกล่าวให้แก่บริษัทตัวแทนประกันชีวิต
                  ของบริษัท หรือผู้แทนของบริษัท หรือบริษัทนายหน้าประกันภัย
                  หรือผู้ถือกรมธรรม์ เพื่อการขอเอาประกันภัย
                  หรือการจ่ายเงินตามกรมธรรม์ประกันภัย หรือค่าเนินการใด ๆ
                  ที่เกี่ยวข้องกับกรมธรรม์ประกันภัย
                </p>
                <p className="indent-8">
                  ข้าพเจ้ายินยอมให้ บริษัท เก็บรวบรวม ใช่
                  และเปิดเผยข้อมูลส่วนบุคคล ข้อมูลสุขภาพ ความพิการ
                  พฤติกรรมทางเพศ ข้อมูลชีวภาพ ข้อมูลพันธุกรรม เชื้อชาติ และ
                  ประวัติการรักษาพยาบาลของข้าพเจ้า
                  ต่อหน่วยงานที่มีอ่านาจตามกฎหมาย หรือบริษัทนายหน้าประกันภัยต่อ
                  หรือต่อบริษัทประกันภัยต่อ บุคคลที่เกี่ยวข้อง ตัวแทนประกันชีวิต
                  ของบริษัท บุคคลากร หรือผู้แทนของบริษัท หรือผู้ถือกรมธรรม์
                  และ/หรือบริษัทนายหน้าประกันภัย
                  เพื่อการขอเอาประกันภัยหรือการจ่ายเงินตามกรมธรรม์ประกันภัย
                  หรือใชประโยชน์ทางการแพทย์หรือเพื่อใช้ในการดาเนินการใด ๆ
                  ที่เกี่ยวกับกรมธรรม์ประกันภัย
                </p>
                <p className="indent-8">
                  กรณีที่เรียกร้องสินไหมผ่านโรงพยาบาล ข้าพเจ้ายินยอมและตกลงให้
                  บริษัทจ่ายค่ารักษาพยาบาลให้แก่สถานพยาบาลที่ข้าพเจ้าได้เข้ารับการรักษานี้
                  โดยถือเสมือน
                  หนึ่งบริษัทได้จ่ายชดเชยค่ารักษาพยาบาลให้แก่ข้าพเจ้าโดยชอบแล้วตามข้อกําหนดและเงื่อนไขแห่งกรมธรรม์ประกันภัย
                  ทั้งนี้ ค่ารักษาพยาบาลใด ๆ ที่อยู่นอกเหนือความ
                  คุ้มครองของกรมธรรม์ประกันภัย
                  ข้าพเจ้าจะเป็นผู้ชําระให้แก่สถานพยาบาลโดยตรงเอง และ
                  ข้าพเจ้าเข้าใจเป็นอย่างดีว่า
                  บริษัทจะขอสงวนสิทธิ์ตามข้อตกลงในโครงการชําระ
                  ค่ารักษาพยาบาลผ่านโรงพยาบาล
                  หากตรวจสอบพบว่าการเจ็บป่วยหรืออุบัติเหตุของข้าพเจ้าอยู่ภายใต้เงื่อนไขข้อยกเว้นของกรมธรรม์ประกันภัย
                  แม้บริษัทจะได่ให้ความ
                  เห็นชอบในการรับตัวไว้เป็นผู้ป่วยในเบื้องต้นแล้วก็ตาม ในกรณีนี้
                  หากบริษัทได้สารองจ่ายค่ารักษา
                  ให้แก่สถานพยาบาลแทนข้าพเจ้าไปแล้วข้าพเจ้ายินยอมที่จะชาระเงินทั้งสิ้น
                  คืนแก่บริษัทภายใน 7 วันนับจากวันที่ได้รับค่าบอกกล่าวจากบริษัท
                </p>
                <p className="indent-8">
                  อนึ่ง สาเนาใบหนังสื่อให้ความยินยอม
                  ให้ถือว่ามีผลบังคับได้เช่นเดียวกับต้นฉบับ
                </p>
                <p className="indent-8">
                  ข้าพเจ้าได้
                  ทราบและเข้าใจข้อความตลอดจนเงื่อนไขและวิธีปฏิบัติของบริษัทตามเอกสารฉบับนี้
                  เป็นอย่างดีโดยละเอียดครบถ้วนแล้ว เห็นว่าถูกต้องตามเจตนาของ
                  ข้าพเจ้าจึงได้ตกลงยินยอมผูกพันปฏิบัติตามเงื่อนไข
                  และวิธีปฏิบัติของบริษัท ทุกประการ
                </p>
                <p className="font-bold">หมายเหตุ :</p>
                <p className="pl-4">
                  * กรณีผู้เอาประกันภัยเป็นผู้เยาว์
                  ให้ผู้ปกครองลงนามแทนพร้อมระบุความสัมพันธ์
                </p>
                <p className="pl-4">
                  ** กรณีลงนามโดยใชวิธีพิมพ์ลายนิ้วมือ ต้องมีพยานลงนามรับรอง 2
                  ท่าน
                </p>
              </div>
              <div className=" text-sm pl-4.5 mt-4">
                <div className="flex items-center gap-1">
                  <p>
                    ผู้เอาประกันภัย :
                    ................................................
                  </p>
                  <p>วันที่ : ...........................................</p>
                  <p className="pl-4">
                    พยาน : ..........................................
                  </p>
                  <p className="pl-4">พยาน : ..........................................</p>
                </div>
                <div className="pl-16 flex items-center gap-1">
                  <p>(................................................)</p>
                  <p>ความสัมพันธ์ : .............................</p>
                  <p className="pl-10">(..........................................)</p>
                  <p className="pl-10">(..........................................)</p>
                </div>
                <div className="flex items-center gap-1">
                  <p>
                    ผู้ให้ความยินยอม :
                    .............................................
                  </p>
                  <p className="pl-2">ในฐานะ ☐ บิดา/มารดา</p>
                </div>
                <div className="flex items-center gap-1">
                  <p className="pl-54.5">
                    ☐ ผู้เเทนโดยชอบธรรมของผู้เอาประกันภัย
                    (กรณีผู้เอาประกันภัยยังไม่บรรลุนิติภาวะ)
                  </p>
                </div>
              </div>
            </div>
          </div>
          <div className="border-l border-r border-b px-2 pb-2">
            <h1 className="text-center text-lg font-bold">For Hospital</h1>
            <div className="mt-1 px-3">
              <div className="text-xs flex gap-2 ">
                <p>1.</p>
                <p className="pl-3">
                  Visit date : ...........................................................
                </p>
                <p>Time : ........................................................</p>
                <p>Vital signs : T : ...................................................</p>
                <p>p : ...................................................</p>
                <p>BP : .........................................................</p>
              </div>
              <div className=" text-xs flex gap-2">
                <p>2.</p>
                <p className="pl-3">
                  Chief complaint and duration :
                  ...................................................................................................................................................................................................................................................................................................................
                </p>
              </div>
              <div className=" text-xs flex gap-2">
                <p>3.</p>
                <p className="pl-3">
                  Present illness or cause of injury :
                  ..............................................................................................................................................................................................................................................................................................................
                </p>
              </div>
              <div className="text-xs pl-7.5">
                <p>
                  ............................................................................................................................................................................................................................................................................................................................................................................
                </p>
                <p>
                  ............................................................................................................................................................................................................................................................................................................................................................................
                </p>
              </div>

              <div className=" text-xs flex gap-2">
                <p>4.</p>
                <p className="pl-3">
                  Physical exam :
                  ......................................................................................................................................................................................................................................................................................................................................................
                </p>
              </div>
              <div className="text-xs pl-7.5">
                <p>
                  ................................................................................................................................................................................................................................................................................................................................................................................
                </p>
              </div>
              <div className=" text-xs flex gap-2">
                <p>5.</p>
                <p className="pl-3">
                  Previous treatment for this illness or injury (Date & Place) :
                  ..............................................................................................................................................................................................................................................................
                </p>
              </div>
              <div className=" text-xs flex gap-2">
                <p>6.</p>
                <p className="pl-3">
                  Is the illness related to : (please tick ☑ if yes)
                </p>
              </div>
              <div className="pl-7 text-xs grid grid-cols-2">
                <p>
                  ☐ Pregnancy / Childbirth / Infertillty / Caesarean section /
                  Miscarriage
                </p>
                <p>☐ Congenital / Hereditary disease </p>
                <p >
                  ☐ Nervous / Mental / Emotional / Sleeping disorder
                </p>
                <p>☐ Influence of Drugs / Alcohol</p>
                <p>
                  ☐ Cosmetic reason / Dental care / Refractive errors correction
                </p>
                <p>☐ AIDS</p>
              </div>
              <div className="pl-7 text-xs flex gap-2">
                <p>
                  ☐ An accident; Date of accident :
                  ....................................................
                </p>
                <p>
                  Time :
                  .....................................................................................................................
                </p>
              </div>
              <div className=" text-xs flex gap-2">
                <p>7.</p>
                <p className="pl-3">
                  Underlying condition :
                  ...................................................................................................................................................................................................................................................................................................................................
                </p>
              </div>
              <div className=" text-xs flex gap-2">
                <p>8.</p>
                <p className="pl-3">
                  Provisional diagnosis :
                  ........................................................................................................................................................................................................
                </p>
                <p>
                  AdjRw=
                  ......................................................................................................
                </p>
              </div>
              <div className=" text-xs flex gap-2">
                <p>9.</p>
                {/* <p className="pl-3">
              Inverstigation & Result (Lab, EKG, X - ray, etc) :
              ..............................................................................................................................................................
            </p> */}
                <p className="pl-3">
                  Can The condition be mannaged under Out Patient basis ◯ Yes ◯
                  No
                </p>
              </div>
              <div className="text-xs pl-7.5">
                <p>
                  (If No place provide more
                  information)..............................................................................................................................................................................................................................................................................................
                </p>
              </div>
              <div className=" text-xs flex gap-2">
                <p>10.</p>
                <p className="pl-1">Reasons of admission</p>
                <p>
                  ................................................................................................................................................................................................................................................................................................................................
                </p>
              </div>
              <div className="text-xs flex gap-2 ">
                <p>11.</p>
                <p className="pl-1">Plan of treatment</p>
                <p>
                  ........................................................................................................................................................................................................................................................................................................................................
                </p>
              </div>
              <div className=" text-xs flex gap-2 pt-3">
                <p>
                  Physician's name
                  <span className="pl-6">
                    ........................................................................
                  </span>
                </p>
                <p className="pl-6">
                  Medical license No. ........................................
                </p>
                <p className="pl-3">Specialty. ......................................................................................</p>
              </div>
              <div className=" text-xs flex gap-2 pl-22">
                <p>
                  (....................................................................)
                </p>
                <p className="pl-20">Date ........................................</p>
              </div>
            </div>
          </div>
        </div>
        <div className="mt-10"></div>
        {/* part B IPD */}
        <div
          className="text-gray-800"
          style={{
            paddingTop: 5,
            width: "800px",
            margin: "0 auto",
            // fontFamily: "Sarabun",
          }}
        >
          <h1 className="text-md/2 font-bold pl-0.5">
            Discharge Notification Form
          </h1>
          <div className="pl-6 ">
            <div className="flex gap-[100px] text-lg">
              <p>
                Company Name.................................................
              </p>
              <p>
                Hospital Name <span>พระปกเกล้า จันทบุรี</span>
              </p>
            </div>
          </div>
          <p className="text-lg pl-0.5">
            <strong>Part B</strong>
          </p>
          <div className="border px-2 pb-3">
            <h1 className="text-center text-lg font-bold">
              Medical certification
            </h1>
            <div className="mt-1">
              <div className="flex gap-1 text-xs">
                <p>
                  Patient's Name :
                  .............................................................................................................
                </p>
                <p>Sex ◯ Male ◯ Female</p>
                <p>HN : ..................................................</p>
                <p>AN : ..................................................</p>
                <p>Age : .................... Year(s)</p>

                <p>................... Month(s)</p>
              </div>
              <div className="flex gap-1 text-xs">
                <p>Admission Date : .........................................................</p>
                <p>Time : ........................................</p>
                <p>Discharge Date : ..............................................................</p>
                <p>Time : ..............................................</p>
                <p>Consultation Date : ........................................................</p>
              </div>
            </div>
          </div>
          <div className="border-l border-r border-b flex">
            <div className="text-xs border-r w-1/2 px-1 pt-2 pb-4">
              <h1 className="text-lg font-bold">1. For Illness</h1>
              <div className="px-5">
                <p>
                  a) Date you first saw this patient for this illness :
                  .......................................................................................
                </p>
                <p>
                  ....................................................................................................................................................................................
                </p>
                <p>
                  ....................................................................................................................................................................................
                </p>
                <p>
                  a) Chief complaint and duration of symptom :
                  ............................................................................................
                </p>
                <p>
                  ....................................................................................................................................................................................
                </p>
                <p>
                  ....................................................................................................................................................................................
                </p>
                <p>
                  ....................................................................................................................................................................................
                </p>
                <p>
                  ....................................................................................................................................................................................
                </p>
                <p>
                  ....................................................................................................................................................................................
                </p>
                <p>
                  ....................................................................................................................................................................................
                </p>
              </div>
            </div>
            <div className="text-xs w-1/2 px-1 pt-2 pb-4">
              <h1 className="text-lg font-bold">2. For Injury</h1>
              <div className="px-5">
                <p className="flex gap-2 ">
                  <span>
                    {" "}
                    a) Date of injury ......................................
                  </span>
                  <span> Time : .....................................</span>
                </p>
                <p>
                  b) Cause of injury
                  .......................................................................................
                </p>
                <p>
                  c) Detail of injury
                  .......................................................................................
                </p>
                <p>d) Did you smell alcohol from the patient?</p>
                <p className="pl-3.5">( ) No ( ) Not known</p>
                <p className="pl-3.5">
                  ( ) yes blood alcohol test (if any) = .....................mg%
                </p>
                <div className="grid grid-cols-5">
                  <p className="col-span-2">e) Level of consciousness</p>
                  <p>( ) Normal</p>
                  <p>( ) Confusion</p>
                  <p className="col-span-2 pl-3.5">( ) Drowsiness</p>
                  <p>( ) Semi-coma</p>
                  <p>( ) Coma</p>
                </div>
                <p>
                  f) Estimated time for recovery :
                  .................................................................
                </p>
                <p>
                  .....................................................................................................................
                </p>
              </div>
            </div>
          </div>
          <div className="border-l border-r border-b px-1 pt-1 pb-4 text-xs">
            <p>
              <span>3.</span>
              <span className="pl-2">
                Did the patient need to be admintted to hospital? ( ) No ( )
                Yes, indication for admission
                ...............................................................................................................................................................................................................................
              </span>
            </p>
            <p className="pl-5">
              ....................................................................................................................................................................................................................................................................................................................................................................................................
            </p>
            <p className="flex gap-2 mt-1">
              <span>4. </span>
              <span>Vital signs : T...................................................................................</span>
              <span>P....................................................................................</span>
              <span>R....................................................................................</span>
              <span>BP....................................................................................</span>
            </p>
            <p className="flex gap-2">
              <span>5.</span>
              <span>
                {" "}
                Pertinent Cinical findings (Symptoms &
                Signs).............................................................................................................................................................................................................................................................................................................
              </span>
            </p>
            <p className="pl-5">
              ..............................................................................................................................................................................................................................................................................................................................................................................................
            </p>
            <p className="flex gap-2 mt-1">
              <span>6.</span>
              <span>
                {" "}
                Investigation & Result (Lab, EKG, X-ray,
                etc.)............................................................................................................................................................................................................................................................................................................
              </span>
            </p>
            <p className="pl-5">
              ......................................................................................................................................................................................................................................................................................................................................................................................
            </p>
            <p className="flex gap-2 mt-1">
              <span>7.</span>
              <span>HIV Test</span>
              <span>
                ( ) No ( ) Yes, Result :
                ..........................................................................................................................................................................................
              </span>
              <span>
                Date performed :
                .....................................................................................................
              </span>
            </p>
            <p className="flex gap-2">
              <span>8.</span>
              <span>
                {" "}
                Underlying disease :
                .............................................................................................................................................................................................................................................................................................................................................................................................
              </span>
            </p>
            <div className="flex gap-2">
              <span> 9.</span>
              <div>
                <p>
                  <span>
                    Diagnosis 1 :
                    .....................................................................................................................................................................................................................
                  </span>
                  <span>
                    ICD10-TM :
                    .......................................................
                  </span>
                </p>
                <p>
                  <span>
                    Diagnosis 2 :
                    .....................................................................................................................................................................................................................
                  </span>
                  <span>
                    ICD10-TM :
                    .......................................................
                  </span>
                </p>
                <p>
                  <span>
                    Diagnosis 3 :
                    .....................................................................................................................................................................................................................
                  </span>
                  <span>
                    ICD10-TM :
                    .......................................................
                  </span>
                </p>
                <p className="absolute left-1">
                  10. Treatment :
                  ..................................................................................................................................................................................................................................................................................................
                </p>
                <br />
                <p className="pl-1">
                  ....................................................................................................................................................................................................................................................................................................................
                </p>
              </div>
              <div className="grid grid-cols-2 border w-30 mt-2 h-16.5">
                <div className="w-17 h-8 border-r border-b"></div>
                <div className="h-8 border-b "></div>
                <div className="w-17 h-8 border-r flex justify-center items-center">
                  <p className="text-[10px]">Adjusted RW</p>
                </div>
                <div className="h-8 "></div>
              </div>
            </div>
            <p className="mt-1">
              <span>
                11. Surgery/Operation :
                ........................................................................................................................................................................................
              </span>
              <span> ICD9-CM : .............................................................</span>
              <span> Date performed : ......................................................</span>
            </p>
            <p className="pl-4">
              Anaesthesia Type : ( ) General Anaesthesia ( ) Spinal Anaesthesia
              ( ) Local Anaesthesia ( ) Others
              ......................................................................................................................................................................................................................
            </p>
            <p className="mt-1">
              12. Pathological report :
              .................................................................................................................................................................................................................................................................................................................................................................
            </p>
            <p>
              13. Complications (if any) :
              ............................................................................................................................................................................................................................................................................................................................................................
            </p>
            <p className="flex gap-2 mt-1">
              <span>
                14. Is the illness related to alcohol, drug abuse or
                addiction?{" "}
              </span>
              <span className="pl-1">
                ( ) No ( ) Yes, Please specify
                ...............................................................................................................
              </span>
            </p>
            <p className="mt-1">
              <span>15. For Female :</span>
              <span className="pl-2">Is the patient pregnart?</span>
              <span className="pl-21">
                ( ) No ( ) Yes, Gestational
                age...................................weeks
              </span>
            </p>
            <p>
              <span className="pl-17">
                Was the treatment related to infertility?
              </span>
              <span className="pl-5.5">
                ( ) No ( ) Yes, Please specify
                ...............................................................................................................
              </span>
            </p>
            <p className="mt-1">
              <span>
                16. Has patient ever been treatment by another doctor before?
              </span>

              <span className="pl-1.5">
                ( ) No ( ) Yes, Please give mane and
                address.......................................................................................
              </span>
            </p>
            <p className="mt-1">
              17. Was the illness/injury contributed to or influenced by any of
              the following
            </p>
            <p className="pl-5">
              <span>a) Physical defects/congenital anomaly</span>
              <span className="pl-2">( ) No ( ) Yes</span>
            </p>
            <p className="pl-5">
              <span>b) Degenerative change(s)</span>
              <span className="pl-14.5">( ) No ( ) Yes</span>
            </p>
            <p className="mt-1">18. Other past medical history</p>

            <div className="px-6 mt-1">
              <table className="border w-full border-collapse">
                <thead>
                  <tr className="text-xs">
                    <th className="border">Date</th>
                    <th className="border">Signs & Symptoms</th>
                    <th className="border">Diagnosis</th>
                    <th className="border">Treatment</th>
                    <th className="border">Hospital</th>
                  </tr>
                </thead>
                <tbody>
                  <tr>
                    <td className="border">&nbsp;</td>
                    <td className="border">&nbsp;</td>
                    <td className="border">&nbsp;</td>
                    <td className="border">&nbsp;</td>
                    <td className="border">&nbsp;</td>
                  </tr>
                  <tr>
                    <td className="border">&nbsp;</td>
                    <td className="border">&nbsp;</td>
                    <td className="border">&nbsp;</td>
                    <td className="border">&nbsp;</td>
                    <td className="border">&nbsp;</td>
                  </tr>
                </tbody>
              </table>
            </div>

            <p className="mt-1">
              19. Other comments about the injury /
              illness..........................................................................................................................................................................................
            </p>
            <p className="pl-5">
              ............................................................................................................................................................................................................................................................
            </p>
          </div>
          <div className="border-l border-r border-b px-1 pt-1 pb-4 text-xs">
            <p>
              I , hereby certify that i have personally examined and treatment
              the insured in connection with the disbility and that the facts
              are in my opinion as given above.
            </p>
            <p className="flex gap-2 mt-1">
              <span>Physician' singature</span>
              <span className="pl-2">
                ..........................................................
              </span>
              <span className="pl-2">Medical specialty :</span>
              <span>
                ......................................................
              </span>
              <span>Thai Medical license no :</span>
              <span>....................</span>
            </p>
            <p className="pl-28">
              <span>
                (.........................................................)
              </span>
              <span className="pl-3">
                Tel no :
                .........................................................................
              </span>
              <span className="pl-3">
                Date : ....................................................
              </span>
            </p>
            <p className="mt-1">
              <span>
                Medical insitute :
                ...................................................................
              </span>
              <span className="pl-3.5">
                Address :
                .........................................................................................................................................
              </span>
            </p>
          </div>
          <p className="text-xs mt-1">
            Remark : Doctor who issue this report must be a doctor who is
            licensed to practice medicine and correctly registered by the Thai
            Medical Council
          </p>
        </div>
      </div>
    </Suspense>
  );
}
